## Series DataStructure in Pandas

This is a data structure which has cross over between a list and dictionary.

Items are all stored in order and there are labels which with these can be retrieved.

In [4]:
import pandas as pd
pd.Series?

In [5]:
animals = ['Tiger', 'Bear', 'Moose']
pd.Series(animals)

0    Tiger
1     Bear
2    Moose
dtype: object

In [6]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [7]:
# Important thing to note is how the Pandas (using NumPy underneath) handle missing data
animals = ['Tiger', 'Bear', None]
pd.Series(animals) # Note the type as object, it inserts None

0    Tiger
1     Bear
2     None
dtype: object

In [8]:
numbers = [1, 2, None]
pd.Series(numbers) # not there the type is float & missing data is NaN (similar to None but for numeic values)

0    1.0
1    2.0
2    NaN
dtype: float64

In [9]:
# NaN is not None
import numpy as np
np.nan == None

False

In [10]:
# The equality test of NaN can't be done
np.nan == np.nan

False

In [11]:
# Special functions to test for the presence of Nan
np.isnan(np.nan)

True

In [12]:
# Series can be created from the dictionaries as well
sports = { 'Archery': 'Bhutan',
         'Golf': 'Scotland',
         'Hockey': 'India'}
s = pd.Series(sports)
s # Note the type is set as object for the elements

Archery      Bhutan
Golf       Scotland
Hockey        India
dtype: object

In [13]:
type(s)

pandas.core.series.Series

In [14]:
# get the index object
s.index

Index(['Archery', 'Golf', 'Hockey'], dtype='object')

In [15]:
# Index can be passed as a separate list during the Series creation
s = pd.Series(['Tiger', 'Bear', 'Moose'], index=['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [16]:
# What happens when the indices are missing, Pandas will add NaN
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports, index=['Golf', 'Sumo', 'Hockey'])
s

Golf      Scotland
Sumo         Japan
Hockey         NaN
dtype: object

### Querying a Series

In [17]:
sports = {'Archery': 'Bhutan',
          'Golf': 'Scotland',
          'Sumo': 'Japan',
          'Taekwondo': 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [18]:
# Query using the index. Use .iloc attribute
s.iloc[3]

'South Korea'

In [19]:
s.loc['Golf'] # Query using the label . use .loc attribute

'Scotland'

In [20]:
s.loc

In [21]:
s[3] # Panda Series, takes integer input and uses iLoc to determine the value using index position

'South Korea'

In [22]:
s['Golf'] # If string input then it uses label

'Scotland'

In [24]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)
s[0] #This won't call s.iloc[0] as one might expect, it generates an error instead

KeyError: 0

In [26]:
s = pd.Series([100.00, 120.00, 101.00, 3.00])
s

0    100.0
1    120.0
2    101.0
3      3.0
dtype: float64

In [27]:
# work on top of data, typical approach 
total = 0
for item in s:
    total += item
print(total)

324.0

Pandas and underlying NumPy library supports Vectorization - works with most of the functions in NumPy library.

In [28]:
import numpy as np
total = np.sum(s)
print(total)

324.0

In [29]:
# Now which one is faster. We need to create a bigger series
s = pd.Series(np.random.randint(0, 1000, 10000))
s.head()

0    544
1    138
2    505
3    260
4    720
dtype: int32

In [30]:
len(s)

10000

In [31]:
%%timeit -n 100 # magic function to  time the execution of the code. -n 100 (no of loops)
summary = 0
for item in s:
    summary += item

100 loops, best of 3: 1.21 ms per loop

In [32]:
%%timeit -n 100
summary = np.sum(s)

100 loops, best of 3: 168 µs per loop

**Wow! Vectorization has some termendous speed benefits.**

In [33]:
# Broadcasting - applying some changes to all the elements of the Series
s += 2 # This is the parallel computing way of doing this
s.head()

0    546
1    140
2    507
3    262
4    722
dtype: int32

In [34]:
# If the above is to be done in procedural way then it would be tedious
for label, value in s.iteritems():
    s.set_value(label, value+2)
s.head()

c:\users\deepak_dhami\appdata\local\programs\python\python35-32\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: set_value is deprecated and will be removed in a future release. Please use .at[] or .iat[] accessors instead
  This is separate from the ipykernel package so we can avoid doing imports until

0    548
1    142
2    509
3    264
4    724
dtype: int32

In [35]:
# Series can have heterogeneous elements
s = pd.Series([1, 2, 3])
s.loc['Animal'] = 'Bears' # Use the .loc attribute to add more items to the series (if it does not exist)

In [36]:
s

0             1
1             2
2             3
Animal    Bears
dtype: object

In [37]:
# What happens if the lables are not unique
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])
all_countries = original_sports.append(cricket_loving_countries) # returns a new Series, watch out for Pandas methods returning new objects

In [38]:
original_sports

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [39]:
cricket_loving_countries

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [40]:
all_countries # Note the same index values

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [41]:
all_countries['Cricket'] # Returns a Series object

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

# DataFrame Data Structure

Heart of the pandas library. 2-D Series object.

In [42]:
import pandas as pd
purchase_1 = pd.Series({'Name': 'Deepak',
                       'Item Purchased': 'Football Shoes',
                       'Cost': 2700})
purchase_2 = pd.Series({'Name': 'Neil',
                       'Item Purchased': 'Running Shoes',
                       'Cost': 2400})
purchase_3 = pd.Series({'Name': 'Samiksha',
                       'Item Purchased': 'Hookah',
                       'Cost': 1500})
purchase_4 = pd.Series({'Name': 'Harry',
                       'Item Purchased': 'Notebook',
                       'Cost': 200})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3, purchase_4], index=['Amazon', 'AliExpress', 'Flipkart', 'Amazon'])
df.head() # Notice below how the notebook renders it in a  nice table format

            Cost  Item Purchased      Name
Amazon      2700  Football Shoes    Deepak
AliExpress  2400   Running Shoes      Neil
Flipkart    1500          Hookah  Samiksha
Amazon       200        Notebook     Harry

In [43]:
# Look at the items purchased from Amazon
df.loc['Amazon']

        Cost  Item Purchased    Name
Amazon  2700  Football Shoes  Deepak
Amazon   200        Notebook   Harry

In [44]:
# Notice that the type of the object returned is a Dataframe if there is more than one Series in the output from the .loc attribute
type(df.loc['Amazon'])

pandas.core.frame.DataFrame

In [45]:
type(df.loc['Flipkart']) # Here the type of object returned is 1 and hence a Series object is returned

pandas.core.series.Series

In [46]:
# If we want to reference only the cost of items purchased from the Amazon store. \
# Pandas dataframes allows selecting values based on both the indices
df.loc['Amazon', 'Cost']

Amazon    2700
Amazon     200
Name: Cost, dtype: int64

In [47]:
# If we want to pull the Name & cost from alll the stores  and .loc supports slicing
df.loc[:, ['Name', 'Cost']]

                Name  Cost
Amazon        Deepak  2700
AliExpress      Neil  2400
Flipkart    Samiksha  1500
Amazon         Harry   200

In [48]:
type(df.loc[:, ['Name', 'Cost']]) # Notice that this returns a dataframe

pandas.core.frame.DataFrame

In [49]:
# What if we wanted the cost attribute from all the stores.
# One approach can be to do a Transpose, thus converting the Cost as a row and then using .loc attribute to select it
df.T

                        Amazon     AliExpress  Flipkart    Amazon
Cost                      2700           2400      1500       200
Item Purchased  Football Shoes  Running Shoes    Hookah  Notebook
Name                    Deepak           Neil  Samiksha     Harry

In [50]:
df.T.loc['Cost']

Amazon        2700
AliExpress    2400
Flipkart      1500
Amazon         200
Name: Cost, dtype: object

In [51]:
# But this is ugly, we can instead do this. Dataframes already has this built in
df['Cost']

Amazon        2700
AliExpress    2400
Flipkart      1500
Amazon         200
Name: Cost, dtype: int64

In [52]:
# Index references can be chained like below (comes with cost, Pandas return a copy when chaining used instead of view on the data.
# So try avoiding it). 
# Below is equivalent to -> df.loc{'Amazon', 'Cost'}
df.loc['Amazon']['Cost']

Amazon    2700
Amazon     200
Name: Cost, dtype: int64

#### Dropping data in Pandas dataframes

The drop method returns a new dataframe , it does not do an inplace change (mentioned otherwise).
It allows dropping a column as well.

In [53]:
df.drop('Flipkart') # Takes the row index as argument (default) to drop the rows

            Cost  Item Purchased    Name
Amazon      2700  Football Shoes  Deepak
AliExpress  2400   Running Shoes    Neil
Amazon       200        Notebook   Harry

In [54]:
df # wait the original dataframe is not modified

            Cost  Item Purchased      Name
Amazon      2700  Football Shoes    Deepak
AliExpress  2400   Running Shoes      Neil
Flipkart    1500          Hookah  Samiksha
Amazon       200        Notebook     Harry

In [55]:
copy_df = df.copy()
copy_df = copy_df.drop('Flipkart')
copy_df

            Cost  Item Purchased    Name
Amazon      2700  Football Shoes  Deepak
AliExpress  2400   Running Shoes    Neil
Amazon       200        Notebook   Harry

In [56]:
help(df.drop) # Notice the inplace set to False , change this to True if we need to modify the original dataframe
# Also see the axis=0, change this to 1 if you need to drop columns instead
# See the help below it has some examples

Help on method drop in module pandas.core.generic:

drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise') method of pandas.core.frame.DataFrame instance
    Return new object with labels in requested axis removed.

    Parameters
    ----------
    labels : single label or list-like
        Index or column labels to drop.
    axis : int or axis name
        Whether to drop labels from the index (0 / 'index') or
        columns (1 / 'columns').
    index, columns : single label or list-like
        Alternative to specifying `axis` (``labels, axis=1`` is
        equivalent to ``columns=labels``).

        .. versionadded:: 0.21.0
    level : int or level name, default None
        For MultiIndex
    inplace : bool, default False
        If True, do operation inplace and return None.
    errors : {'ignore', 'raise'}, default 'raise'
        If 'ignore', suppress error and existing labels are dropped.

    Returns
    -------
    dropped : type of caller

    Examples
    --------
    >>> df = pd.DataFrame(np.arange(12).reshape(3,4),
                          columns=['A', 'B', 'C', 'D'])
    >>> df
       A  B   C   D
    0  0  1   2   3
    1  4  5   6   7
    2  8  9  10  11

    Drop columns

    >>> df.drop(['B', 'C'], axis=1)
       A   D
    0  0   3
    1  4   7
    2  8  11

    >>> df.drop(columns=['B', 'C'])
       A   D
    0  0   3
    1  4   7
    2  8  11

    Drop a row by index

    >>> df.drop([0, 1])
       A  B   C   D
    2  8  9  10  11

    Notes
    -----
    Specifying both `labels` and `index` or `columns` will raise a
    ValueError.

In [57]:
# Another method to drop columns, this modifies the dataframe in place
del copy_df['Name']
copy_df

            Cost  Item Purchased
Amazon      2700  Football Shoes
AliExpress  2400   Running Shoes
Amazon       200        Notebook

In [58]:
# Adding a new column is straight forward, assign it
df['Location'] = 'Bangalore'
df

            Cost  Item Purchased      Name   Location
Amazon      2700  Football Shoes    Deepak  Bangalore
AliExpress  2400   Running Shoes      Neil  Bangalore
Flipkart    1500          Hookah  Samiksha  Bangalore
Amazon       200        Notebook     Harry  Bangalore

### DataFrame indexing and loading

In [59]:
costs = df['Cost']
costs

Amazon        2700
AliExpress    2400
Flipkart      1500
Amazon         200
Name: Cost, dtype: int64

In [60]:
costs += 2 # Use Vectorization to increase all the elements
costs

Amazon        2702
AliExpress    2402
Flipkart      1502
Amazon         202
Name: Cost, dtype: int64

In [61]:
# Important thing to consider here is that the above operation has modified the original dataframe as well.
df

            Cost  Item Purchased      Name   Location
Amazon      2702  Football Shoes    Deepak  Bangalore
AliExpress  2402   Running Shoes      Neil  Bangalore
Flipkart    1502          Hookah  Samiksha  Bangalore
Amazon       202        Notebook     Harry  Bangalore

In [62]:
# Remember if you want to make changes which are not polluting the original dataframe then you should make a call to the copy
# function first
cp_costs = df['Cost'].copy()
cp_costs

Amazon        2702
AliExpress    2402
Flipkart      1502
Amazon         202
Name: Cost, dtype: int64

In [63]:
cp_costs *= 0.8 # 20% discount given
cp_costs

Amazon        2161.6
AliExpress    1921.6
Flipkart      1201.6
Amazon         161.6
Name: Cost, dtype: float64

In [64]:
# Notice how this has not modified the origina dataframe
df

            Cost  Item Purchased      Name   Location
Amazon      2702  Football Shoes    Deepak  Bangalore
AliExpress  2402   Running Shoes      Neil  Bangalore
Flipkart    1502          Hookah  Samiksha  Bangalore
Amazon       202        Notebook     Harry  Bangalore

In [65]:
!dir # Using the ! operator one can execute OS Shell specific commands in iPython

 Volume in drive E is Dexwork
 Volume Serial Number is F0C7-464B

 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning


 Directory of E:\Documents\GitHub\pythonlearning

File Not Found

In [66]:
# Read a CSV file in a dataframe by using the read_csv() method
df = pd.read_csv('olympics.csv')
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
0,NaN,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !,02 !,03 !,Total,№ Games,01 !,02 !,03 !,Combined total
1,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
2,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
3,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
4,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12

In [67]:
# read_csv() method can be instructed which column & row to be taken as index 
df = pd.read_csv('olympics.csv', index_col=0, skiprows=1)
df.head()

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [68]:
# Notice that some of the column names are not properly named.
# time to clean up some of the column names
# Pandas DF stores all the column names in the columns attribute
df.columns

Index(['№ Summer', '01 !', '02 !', '03 !', 'Total', '№ Winter', '01 !.1',
       '02 !.1', '03 !.1', 'Total.1', '№ Games', '01 !.2', '02 !.2', '03 !.2',
       'Combined total'],
      dtype='object')

In [69]:
for col in df.columns:
    if col[:2]=='01':
        df.rename(columns={col:'Gold' + col[4:]}, inplace=True)
    if col[:2]=='02':
        df.rename(columns={col:'Silver' + col[4:]}, inplace=True)
    if col[:2]=='03':
        df.rename(columns={col:'Bronze' + col[4:]}, inplace=True)
    if col[:1]=='№':
        df.rename(columns={col:'#' + col[1:]}, inplace=True)
        
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [70]:
df.index # see the name of the indexes do not show special chars inserted between them

Index(['Afghanistan (AFG)', 'Algeria (ALG)', 'Argentina (ARG)',
       'Armenia (ARM)', 'Australasia (ANZ) [ANZ]', 'Australia (AUS) [AUS] [Z]',
       'Austria (AUT)', 'Azerbaijan (AZE)', 'Bahamas (BAH)', 'Bahrain (BRN)',
       ...
       'Uzbekistan (UZB)', 'Venezuela (VEN)', 'Vietnam (VIE)',
       'Virgin Islands (ISV)', 'Yugoslavia (YUG) [YUG]',
       'Independent Olympic Participants (IOP) [IOP]', 'Zambia (ZAM) [ZAM]',
       'Zimbabwe (ZIM) [ZIM]', 'Mixed team (ZZX) [ZZX]', 'Totals'],
      dtype='object', length=147)

In [71]:
df.iloc[0].name # reference the name of the index

'Afghanistan\xa0(AFG)'

In [72]:
df.loc['Afghanistan\xa0(AFG)'] # Note the special chars that have been inserted :O

# Summer          13
Gold               0
Silver             0
Bronze             2
Total              2
# Winter           0
Gold.1             0
Silver.1           0
Bronze.1           0
Total.1            0
# Games           13
Gold.2             0
Silver.2           0
Bronze.2           2
Combined total     2
Name: Afghanistan (AFG), dtype: int64

### Querying a dataframe

**Boolean masking** - heat of fast and efficient querying in NumPy.
It is an array 1-2 D where each element value is True/False. This array is overlayed on top of any datastructure we are querying and the cell value overlappig with True is emitted.

In [73]:
#For example in our Olympics dataset
# if we want to query only the countries who have won Gold medal in summer olympics.
df['Gold'] > 0 # broadcasting comparison across the series and returing a series back with the boolean values
# this is half the battle since this returns the boolean mask

Afghanistan (AFG)                               False
Algeria (ALG)                                    True
Argentina (ARG)                                  True
Armenia (ARM)                                    True
Australasia (ANZ) [ANZ]                          True
Australia (AUS) [AUS] [Z]                        True
Austria (AUT)                                    True
Azerbaijan (AZE)                                 True
Bahamas (BAH)                                    True
Bahrain (BRN)                                   False
Barbados (BAR) [BAR]                            False
Belarus (BLR)                                    True
Belgium (BEL)                                    True
Bermuda (BER)                                   False
Bohemia (BOH) [BOH] [Z]                         False
Botswana (BOT)                                  False
Brazil (BRA)                                     True
British West Indies (BWI) [BWI]                 False
Bulgaria (BUL) [H]                               True
Burundi (BDI)                                    True
Cameroon (CMR)                                   True
Canada (CAN)                                     True
Chile (CHI) [I]                                  True
China (CHN) [CHN]                                True
Colombia (COL)                                   True
Costa Rica (CRC)                                 True
Ivory Coast (CIV) [CIV]                         False
Croatia (CRO)                                    True
Cuba (CUB) [Z]                                   True
Cyprus (CYP)                                    False
                                                ...
Sri Lanka (SRI) [SRI]                           False
Sudan (SUD)                                     False
Suriname (SUR) [E]                               True
Sweden (SWE) [Z]                                 True
Switzerland (SUI)                                True
Syria (SYR)                                      True
Chinese Taipei (TPE) [TPE] [TPE2]                True
Tajikistan (TJK)                                False
Tanzania (TAN) [TAN]                            False
Thailand (THA)                                   True
Togo (TOG)                                      False
Tonga (TGA)                                     False
Trinidad and Tobago (TRI) [TRI]                  True
Tunisia (TUN)                                    True
Turkey (TUR)                                     True
Uganda (UGA)                                     True
Ukraine (UKR)                                    True
United Arab Emirates (UAE)                       True
United States (USA) [P] [Q] [R] [Z]              True
Uruguay (URU)                                    True
Uzbekistan (UZB)                                 True
Venezuela (VEN)                                  True
Vietnam (VIE)                                   False
Virgin Islands (ISV)                            False
Yugoslavia (YUG) [YUG]                           True
Independent Olympic Participants (IOP) [IOP]    False
Zambia (ZAM) [ZAM]                              False
Zimbabwe (ZIM) [ZIM]                             True
Mixed team (ZZX) [ZZX]                           True
Totals                                           True
Name: Gold, Length: 147, dtype: bool

In [74]:
# Overlaying the boolean mask is done using the where() method
only_gold = df.where(df['Gold'] > 0)
only_gold.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0

In [75]:
len(only_gold)

147

In [76]:
only_gold.count()

# Summer          100
Gold              100
Silver            100
Bronze            100
Total             100
# Winter          100
Gold.1            100
Silver.1          100
Bronze.1          100
Total.1           100
# Games           100
Gold.2            100
Silver.2          100
Bronze.2          100
Combined total    100
dtype: int64

In [77]:
df.count()

# Summer          147
Gold              147
Silver            147
Bronze            147
Total             147
# Winter          147
Gold.1            147
Silver.1          147
Bronze.1          147
Total.1           147
# Games           147
Gold.2            147
Silver.2          147
Bronze.2          147
Combined total    147
dtype: int64

In [78]:
only_gold['Gold'].count() # These many countries have won gold

100

In [79]:
df['Gold'].count() # total countries listed

147

In [80]:
# Dropping rows which are empty (have no data) using dropna() method
only_gold = only_gold.dropna()
only_gold.head() # See how the Afghanistan gets dropped from the previous output

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Algeria (ALG),12.0,5.0,2.0,8.0,15.0,3.0,0.0,0.0,0.0,0.0,15.0,5.0,2.0,8.0,15.0
Argentina (ARG),23.0,18.0,24.0,28.0,70.0,18.0,0.0,0.0,0.0,0.0,41.0,18.0,24.0,28.0,70.0
Armenia (ARM),5.0,1.0,2.0,9.0,12.0,6.0,0.0,0.0,0.0,0.0,11.0,1.0,2.0,9.0,12.0
Australasia (ANZ) [ANZ],2.0,3.0,4.0,5.0,12.0,0.0,0.0,0.0,0.0,0.0,2.0,3.0,4.0,5.0,12.0
Australia (AUS) [AUS] [Z],25.0,139.0,152.0,177.0,468.0,18.0,5.0,3.0,4.0,12.0,43.0,144.0,155.0,181.0,480.0

In [92]:
only_gold['Gold'].count() # Also see that this count has changed

100

In [93]:
# Shortcut present to apply boolean masking without where() using the indexing operator
only_gold = df[df['Gold'] > 0] # using this method auto filters out rows with No values :)
only_gold.head()

,Gold,# Summer,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,country
1,5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
2,18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
3,1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
4,3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]
5,139,25,152,177,468,18,5,3,4,12,43,144,155,181,480,Australia (AUS) [AUS] [Z]

In [94]:
only_gold['Gold'].count()

100

In [99]:
(df[(df['Gold'] > 0) | (df['Gold.1'] > 0)])['Gold'].sum()

9618

In [84]:
len(df[(df['Gold'] > 0) | (df['Gold.1'] > 0)]) # Bit-wise operation on two boolean mask is another b-mask
# This allows for some complex chaining like in this example
# Look for countries which have gold medal in Summer or Winter Onlympics

101

In [85]:
# Find countries who have only won gold in Winter olympics but not in Summer
df[(df['Gold'] == 0) & (df['Gold.1'] > 0)]

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Liechtenstein (LIE),16,0,0,0,0,18,2,2,5,9,34,2,2,5,9

**Note**
*Each boolean mask needs to be placed in parentheses to tell the order of operation.*
This will save some frustration.

### Indexing Dataframes

In [86]:
df.head()

,# Summer,Gold,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [87]:
# If we want to set the number of golds won column as the index for the Dataframe.
df['country'] = df.index # preserve the existing index
df = df.set_index('Gold')
df.head()

,# Summer,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,country
Gold,,,,,,,,,,,,,,,
0,13,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan (AFG)
5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]

**NOTE**

It appears that a new row has been added. This isn't what is happening because the empty values in Numeric are represented as NaN. Instead the Jupyter-notebook has just provided us with the Column name now.

In [88]:
# Get rid of the index completely and default it to a numeric one 
df = df.reset_index()
df.head()

,Gold,# Summer,Silver,Bronze,Total,# Winter,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total,country
0,0,13,0,2,2,0,0,0,0,0,13,0,0,2,2,Afghanistan (AFG)
1,5,12,2,8,15,3,0,0,0,0,15,5,2,8,15,Algeria (ALG)
2,18,23,24,28,70,18,0,0,0,0,41,18,24,28,70,Argentina (ARG)
3,1,5,2,9,12,6,0,0,0,0,11,1,2,9,12,Armenia (ARM)
4,3,2,4,5,12,0,0,0,0,0,2,3,4,5,12,Australasia (ANZ) [ANZ]

**Let's read the census data**

In [100]:
df = pd.read_csv('census.csv') # Read the census data
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
0,40,3,6,1,0,Alabama,Alabama,4779736,4780127,4785161,...,0.002295,-0.193196,0.381066,0.582002,-0.467369,1.030015,0.826644,1.383282,1.724718,0.712594
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861

In [101]:
df['SUMLEV'].unique() # See the two distinct values for the SUMLEV attribute

array([40, 50], dtype=int64)

In [102]:
df = df[df['SUMLEV'] == 50] # Apply the boolean mask to retrieve only the values wher SUMLEV == 50
# 
df.head()

,SUMLEV,REGION,DIVISION,STATE,COUNTY,STNAME,CTYNAME,CENSUS2010POP,ESTIMATESBASE2010,POPESTIMATE2010,...,RDOMESTICMIG2011,RDOMESTICMIG2012,RDOMESTICMIG2013,RDOMESTICMIG2014,RDOMESTICMIG2015,RNETMIG2011,RNETMIG2012,RNETMIG2013,RNETMIG2014,RNETMIG2015
1,50,3,6,1,1,Alabama,Autauga County,54571,54571,54660,...,7.242091,-2.915927,-3.012349,2.265971,-2.530799,7.606016,-2.626146,-2.722002,2.592270,-2.187333
2,50,3,6,1,3,Alabama,Baldwin County,182265,182265,183193,...,14.832960,17.647293,21.845705,19.243287,17.197872,15.844176,18.559627,22.727626,20.317142,18.293499
3,50,3,6,1,5,Alabama,Barbour County,27457,27457,27341,...,-4.728132,-2.500690,-7.056824,-3.904217,-10.543299,-4.874741,-2.758113,-7.167664,-3.978583,-10.543299
4,50,3,6,1,7,Alabama,Bibb County,22915,22919,22861,...,-5.527043,-5.068871,-6.201001,-0.177537,0.177258,-5.088389,-4.363636,-5.403729,0.754533,1.107861
5,50,3,6,1,9,Alabama,Blount County,57322,57322,57373,...,1.807375,-1.177622,-1.748766,-2.062535,-1.369970,1.859511,-0.848580,-1.402476,-1.577232,-0.884411

In [104]:
# Let's onl5y,filter the columns we need here
columns_to_keep = ['STNAME',
                  'CTYNAME',
                  'BIRTHS2010',
                  'BIRTHS2011',
                  'BIRTHS2012',
                  'BIRTHS2013',
                  'BIRTHS2014',
                  'BIRTHS2015',
                  'POPESTIMATE2010',
                  'POPESTIMATE2011',
                  'POPESTIMATE2012',
                  'POPESTIMATE2013',
                  'POPESTIMATE2014',
                  'POPESTIMATE2015']

df = df[columns_to_keep]
df.head()

,STNAME,CTYNAME,BIRTHS2010,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
1,Alabama,Autauga County,151,636,615,574,623,600,54660,55253,55175,55038,55290,55347
2,Alabama,Baldwin County,517,2187,2092,2160,2186,2240,183193,186659,190396,195126,199713,203709
3,Alabama,Barbour County,70,335,300,283,260,269,27341,27226,27159,26973,26815,26489
4,Alabama,Bibb County,44,266,245,259,247,253,22861,22733,22642,22512,22549,22583
5,Alabama,Blount County,183,744,710,646,618,603,57373,57711,57776,57734,57658,57673

In [105]:
df = df.set_index(['STNAME', 'CTYNAME']) # using dual colums to be used as index
df.head()

                        BIRTHS2010  BIRTHS2011  BIRTHS2012  BIRTHS2013  \
STNAME  CTYNAME
Alabama Autauga County         151         636         615         574
        Baldwin County         517        2187        2092        2160
        Barbour County          70         335         300         283
        Bibb County             44         266         245         259
        Blount County          183         744         710         646

                        BIRTHS2014  BIRTHS2015  POPESTIMATE2010  \
STNAME  CTYNAME
Alabama Autauga County         623         600            54660
        Baldwin County        2186        2240           183193
        Barbour County         260         269            27341
        Bibb County            247         253            22861
        Blount County          618         603            57373

                        POPESTIMATE2011  POPESTIMATE2012  POPESTIMATE2013  \
STNAME  CTYNAME
Alabama Autauga County            55253            55175            55038
        Baldwin County           186659           190396           195126
        Barbour County            27226            27159            26973
        Bibb County               22733            22642            22512
        Blount County             57711            57776            57734

                        POPESTIMATE2014  POPESTIMATE2015
STNAME  CTYNAME
Alabama Autauga County            55290            55347
        Baldwin County           199713           203709
        Barbour County            26815            26489
        Bibb County               22549            22583
        Blount County             57658            57673

In [106]:
# Now how to query the above data, specify the correct level of index
df.loc['Alabama', 'Baldwin County']

BIRTHS2010            517
BIRTHS2011           2187
BIRTHS2012           2092
BIRTHS2013           2160
BIRTHS2014           2186
BIRTHS2015           2240
POPESTIMATE2010    183193
POPESTIMATE2011    186659
POPESTIMATE2012    190396
POPESTIMATE2013    195126
POPESTIMATE2014    199713
POPESTIMATE2015    203709
Name: (Alabama, Baldwin County), dtype: int64

In [110]:
df.loc[[('Alabama', 'Baldwin County'), ('Michigan', 'Wayne County')]] # can provide a list of tuples for indices

,,BIRTHS2010,BIRTHS2011,BIRTHS2012,BIRTHS2013,BIRTHS2014,BIRTHS2015,POPESTIMATE2010,POPESTIMATE2011,POPESTIMATE2012,POPESTIMATE2013,POPESTIMATE2014,POPESTIMATE2015
STNAME,CTYNAME,,,,,,,,,,,,
Alabama,Baldwin County,517,2187,2092,2160,2186,2240,183193,186659,190396,195126,199713,203709
Michigan,Wayne County,5918,23819,23270,23377,23607,23586,1815199,1801273,1792514,1775713,1766008,1759335

## Missing Values

In [125]:
import pandas as pd
df = pd.read_csv('log.csv')
df.head() # Below you will see many missing values based on the user's video playback

         time    user       video  playback position paused  volume
0  1469974424  cheryl  intro.html                  5  False    10.0
1  1469974454  cheryl  intro.html                  6    NaN     NaN
2  1469974544  cheryl  intro.html                  9    NaN     NaN
3  1469974574  cheryl  intro.html                 10    NaN     NaN
4  1469977514     bob  intro.html                  1    NaN     NaN

In [115]:
df.fillna?

In [126]:
df = df.set_index('time') # set the time as the index

In [127]:
df = df.sort_index() # sort the index

In [128]:
df.head() # indexs are not unique, so good idea to have multiple level indices

              user          video  playback position paused  volume
time
1469974424  cheryl     intro.html                  5  False    10.0
1469974424     sue  advanced.html                 23  False    10.0
1469974454  cheryl     intro.html                  6    NaN     NaN
1469974454     sue  advanced.html                 24    NaN     NaN
1469974484  cheryl     intro.html                  7    NaN     NaN

In [129]:
df = df.reset_index()
#df.head()
df = df.set_index(['time', 'user'])
df.head()

                           video  playback position paused  volume
time       user
1469974424 cheryl     intro.html                  5  False    10.0
           sue     advanced.html                 23  False    10.0
1469974454 cheryl     intro.html                  6    NaN     NaN
           sue     advanced.html                 24    NaN     NaN
1469974484 cheryl     intro.html                  7    NaN     NaN

In [ ]:
# Now the data is sorted, we can use the fillna() method